app/views/movies/show.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
  <h3>Recent Reviews</h3>
  <% if @movie.recent_reviews.any?%>