app/controllers/reviews_controller.rb

  def edit
    @review = @movie.reviews.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", "1"]]

  def update
    @review = @movie.reviews.find(params[:id])
    if @review.update(review_params)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 6], ["id", "2"]]
UPDATE "reviews" SET "comment" = ?, "stars" = ?, "updated_at" = ? WHERE "reviews"."id" = 8  [["comment", "This movie sucks"], ["stars", 1], ["updated_at", Sun, 18 May 2014 18:17:46 UTC +00:00]]

  def destroy
    @review = @movie.reviews.find(params[:id])
    @review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", "3"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 3]]